//=============================================================================
//
// フェードロゴの処理 [fadelogo.h]
// Author : Mikiya Meguro
//
//=============================================================================
#ifndef _FADELOGO_H_
#define _FADELOGO_H_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitFadeLogo(void);
void UninitFadeLogo(void);
void UpdateFadeLogo(void);
void DrawFadeLogo(void);

#endif
