//=============================================================================
//
//	ゲージの処理 [gauge.h]
// Author : Shun Yokomichi
//
//=============================================================================
#ifndef _GAUGE_H_
#define _GAUGE_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitGauge(void);
void UninitGauge(void);
void UpdateGauge(void);
void DrawGaugee(void);

#endif
