//=============================================================================
// 授業作成
// 背景の処理 [timeframe.h]
// Author : Mikiya Meguro
//
//=============================================================================
#ifndef _TIMEFRAME_H_
#define _TIMEFRAME_H_

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTimeFrame(void);
void UninitTimeFrame(void);
void UpdateTimeFrame(void);
void DrawTimeFrame(void);

#endif
