//=============================================================================
//
// リザルトの処理 [tutorial.h]
// Author : Mikiya Meguro
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "main.h"
//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXCOLOR col;						// 色
	D3DXMATRIX	mtrxWorldParticle;		// ワールドマトリックス
	bool bUse;							// 使用しているかどうか
	int nType;							// テクスチャの種類
}TUTORIAL;
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif
