//=============================================================================
// 
// 背景の処理 [rankingbg.h]
// Author 
//
//=============================================================================
#ifndef _RANKINGBG_H_
#define _RANKINGBG_H_

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitRankingBG(void);
void UninitRankingBG(void);
void UpdateRankingBG(void);
void DrawRankingBG(void);
#endif