//=============================================================================
// 授業作成
// 背景の処理 [pause.h]
// Author : 
//
//=============================================================================
#ifndef _SELECTTITLE_H_
#define _SELECTTITLE_H_

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSelectTitle(void);
void UninitSelectTitle(void);
void UpdateSelectTitle(void);
void DrawSelectTitle(void);

#endif