//*****************************************************************************
//
//     タイマーの処理[timer.h]
//     Auther:Hodaka Niwa
//
//*****************************************************************************
#ifndef _TIMER_H_
#define _TIMER_H_

//*****************************************************************************
//     インクルードファイル
//*****************************************************************************
#include "main.h"
#include "scene.h"

//*****************************************************************************
//     マクロ定義
//*****************************************************************************
#define  TIMER_NUMBER_MAX  (3)    // タイマーの桁数

//*****************************************************************************
//     前方宣言
//*****************************************************************************
class CNumber;

//*****************************************************************************
//     タイマークラスの定義
//*****************************************************************************
class CTimer : public CScene
{
public:    // 誰でもアクセス可能
	CTimer(int nPriority = 3, OBJTYPE objType = OBJTYPE_TIMER);
	~CTimer();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTimer *Create(void);

private:   // このクラスだけがアクセス可能
	CNumber *m_apNumber[TIMER_NUMBER_MAX];  // 数字ポリゴンクラス型のポインタ
	int     m_nTimer;                       // タイマー
};

#endif