//*****************************************************************************
//
//     チュートリアルの処理[tutorial.h]
//     Auther:Hodaka Niwa
//
//*****************************************************************************
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//*****************************************************************************
//    インクルードファイル
//*****************************************************************************
#include "main.h"
#include "scene.h"

//*****************************************************************************
//    マクロ定義
//*****************************************************************************

//*****************************************************************************
//    前方宣言
//*****************************************************************************
class CScene2DSquare;

//*****************************************************************************
//    チュートリアルクラスの定義
//*****************************************************************************
class CTutorial : public CScene
{
public:     // 誰でもアクセス可能
	CTutorial(int nPriority = 0, OBJTYPE objType = OBJTYPE_TUTORIAL);
	~CTutorial();

	static CTutorial *Create(void);
	static HRESULT Load(void);
	static void UnLoad(void);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

protected:  // このクラスと派生クラスだけがアクセス可能

private:    // このクラスだけがアクセス可能
	static LPDIRECT3DTEXTURE9 m_apTexture[2];	// テクスチャへのポインタ
	CScene2DSquare *m_apSceneSquare[2];         // チュートリアルで使用するポリゴン
};

#endif