#//=============================================================================
//
// スコア処理 [Score.h]
// Author : Takahiro Syoji 
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "scene.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CNumber;

//*****************************************************************************
// 2Dポリゴンクラス
//*****************************************************************************
class CScore : public CScene
{
public:
	CScore();
	~CScore();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CScore *Create(D3DXVECTOR3 pos);
	void AddScore(int nScore);
	int GetScore(void);

private:
	CNumber *m_apNumber[MAX_NUMBER];
	D3DXVECTOR3 m_pos;
	int m_nScore;
};

#endif