//*****************************************************************************
//
//     UIの処理[ui.h]
//     Auther:Hodaka Niwa
//
//*****************************************************************************
#ifndef _UI_H_
#define _UI_H_

//*****************************************************************************
//    インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
//    マクロ定義
//*****************************************************************************


//*****************************************************************************
//    前方宣言
//*****************************************************************************
class CScene2D;
class CTextureManager;

//*****************************************************************************
//    UIクラスの定義
//*****************************************************************************
class CUI
{
public:    // 誰でもアクセス可能
	//-----------------
	//  状態
	//-----------------
	typedef enum
	{
		STATE_NORMAL = 0,    // 通常状態
		STATE_ALPHACHANGE,   // 透明度を下げている状態
		STATE_MAX
	}STATE;

	CUI();
	~CUI();

	static CUI *Create(CTextureManager *pTextureManager);

	HRESULT Init(CTextureManager *pTextureManager);
	void Uninit(void);
	void Update(void);
	void SetDisp(const bool bDisp);
	bool GetDisp(void);

private:   // このクラスだけがアクセス可能
	STATE              m_State;             // 状態
	CTextureManager    *m_pTextureManager;  // テクスチャ管轄クラスへのポインタ
	bool               m_bDisp;             // UIを描画するかどうか
};

#endif