//*****************************************************************************
//
//     キャラクターの処理[character.cpp]
//     Auther:Hodaka Niwa
//
//*****************************************************************************
#include "character.h"
#include "manager.h"
#include "system.h"
#include "model.h"
#include "motion.h"
#include "3DPolygon.h"
#include "textureManager.h"
#include "object.h"
#include "map.h"
#include "mode.h"

//*****************************************************************************
//    マクロ宣言
//*****************************************************************************

//*****************************************************************************
//    静的メンバ変数宣言
//*****************************************************************************

//=============================================================================
//    コンストラクタ
//=============================================================================
CCharacter::CCharacter(int nPriority, OBJTYPE objType) : CScene(nPriority, objType)
{
	// 各種値の設定
	m_apModel = NULL;                                      // モデルクラスへのポインタ
	m_nNumParts = 0;                                       // 使用するパーツ数
	m_pMotionManager = NULL;                               // モーションクラスへのポインタ
	m_pTextureManager = NULL;                              // テクスチャ管轄クラスへのポインタ
	D3DXMatrixIdentity(&m_MtxWorld);                       // ワールドマトリックス
	m_Pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);                 // 現在の座標
	m_PosOld = D3DXVECTOR3(0.0f, 0.0f, 0.0f);              // 前回の座標
	m_Move = D3DXVECTOR3(0.0f, 0.0f, 0.0f);                // 移動量
	m_Rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);                 // 現在の向き
	m_DestRot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);             // 目的の向き
	m_DiffRot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);             // 目的の向きと現在の向きの差分
	m_fGravity = 0.0f;                                     // 重力
	m_fColHeight = 0.0f;                                   // 当たり判定をとる高さ
	m_fColRange = 0.0f;                                    // 当たり判定を取る範囲
	m_fJumpPower = 0.0f;                                   // ジャンプ量
	m_fRivisionRot = 0.0f;                                 // 向きを補正する倍率
	m_fAccel = 0.0f;                                       // 移動スピード
	m_fInertia = 0.0f;                                     // 慣性
	m_bLand = false;                                       // 前回オブジェクトに乗っていたかどうか
	m_pLandScene = NULL;                                   // 乗っているオブジェクトへのポインタ
	m_pLandSceneOld = NULL;                                // 前回乗っていたオブジェクトへのポインタ
	m_LandOffsetPos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);       // オブジェクトからのオフセット距離
	m_LandOffsetAdd = D3DXVECTOR3(0.0f, 0.0f, 0.0f);       // オフセット距離に加える値
	m_LandOffsetRot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);       // オブジェクトからのオフセット向き
	m_LandOffsetRotStart = D3DXVECTOR3(0.0f, 0.0f, 0.0f);  // 乗ってからの向き
	m_pShadow = NULL;                                      // 影クラスへのポインタ
}

//=============================================================================
//    デストラクタ
//=============================================================================
CCharacter::~CCharacter()
{

}

//=============================================================================
//    初期化処理
//=============================================================================
HRESULT CCharacter::Init(void)
{
	return S_OK;
}

//=============================================================================
//    終了処理
//=============================================================================
void CCharacter::Uninit(void)
{
	// モデルの破棄
	if (m_apModel != NULL)
	{// メモリが確保されている
		for (int nCntModel = 0; nCntModel < m_nNumParts; nCntModel++)
		{// 使用できるモデル数分繰り返し
			if (m_apModel[nCntModel] != NULL)
			{// ポインタが確保されている
				m_apModel[nCntModel]->Uninit();

				// メモリの開放
				delete m_apModel[nCntModel];
				m_apModel[nCntModel] = NULL;
			}
		}
		// メモリの開放
		delete[] m_apModel;
		m_apModel = NULL;
	}

	// モーションの破棄
	if (m_pMotionManager != NULL)
	{// ポインタが確保されている
		m_pMotionManager->Uninit();

		// メモリの開放
		delete m_pMotionManager;
		m_pMotionManager = NULL;
	}

	// 乗っているオブジェクトへのポインタを空にする
	if (m_pLandScene != NULL)
	{// ポインタが空ではない
		m_pLandScene = NULL;
	}

	// 影の開放
	if (m_pShadow != NULL)
	{
		m_pShadow->Uninit();
		m_pShadow = NULL;
	}

	// キャラクターオブジェクトの破棄
	Release();
}

//=============================================================================
//    更新処理
//=============================================================================
void CCharacter::Update(void)
{

}

//=============================================================================
//    描画処理
//=============================================================================
void CCharacter::Draw(void)
{
	// レンダリングクラス型のポインタ
	CRenderer *pRenderer = CManager::GetRenderer();

	if (pRenderer != NULL)
	{// レンダリングクラスが生成されている
	    // デバイスの取得
		LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
		if (pDevice != NULL)
		{// デバイスが取得できた
		    // キャラクターのワールドマトリックス計算処理
			SetMtxWorld(pDevice);

			if (m_apModel != NULL)
			{// メモリが確保できた
			    // モデルの描画
				for (int nCntModel = 0; nCntModel < m_nNumParts; nCntModel++)
				{// モデルを生成する数だけ繰り返し
				    // モデルの描画処理
					m_apModel[nCntModel]->Draw();
				}
			}
		}
	}
}

//=============================================================================
//    描画デバイスにワールドマトリックスを設定する処理
//=============================================================================
void CCharacter::SetMtxWorld(LPDIRECT3DDEVICE9 pDevice)
{
	D3DXMATRIX mtxRot, mtxTrans; // 計算用マトリックス

	// ワールドマトリックスの初期化
	D3DXMatrixIdentity(&m_MtxWorld);

	// 回転を反映
	D3DXMatrixRotationYawPitchRoll(&mtxRot, m_Rot.y, m_Rot.x, m_Rot.z);
	D3DXMatrixMultiply(&m_MtxWorld, &m_MtxWorld, &mtxRot);

	// 位置を反映
	D3DXMatrixTranslation(&mtxTrans, m_Pos.x, m_Pos.y, m_Pos.z);
	D3DXMatrixMultiply(&m_MtxWorld, &m_MtxWorld, &mtxTrans);

	// ワールドマトリックスの設定
	pDevice->SetTransform(D3DTS_WORLD, &m_MtxWorld);
}

//=============================================================================
//    モデルの位置をニュートラルモーションの位置に設定する
//=============================================================================
void CCharacter::SetDefaultPos(void)
{
	if (m_pMotionManager != NULL && m_apModel != NULL)
	{// モーションとモデルが作成されている
		for (int nCntModel = 0; nCntModel < m_nNumParts; nCntModel++)
		{// モデルを生成した数だけ繰り返し
			m_apModel[nCntModel]->SetAddPos(m_pMotionManager->GetMotion()[0]->GetKeyframe()[0][nCntModel]->GetAddPos());
		}
	}
}

//=============================================================================
//    モデルの向きをニュートラルモーションの向きに設定する
//=============================================================================
void CCharacter::SetDefaultRot(void)
{
	if (m_pMotionManager != NULL && m_apModel != NULL)
	{// モーションとモデルが作成されている
		for (int nCntModel = 0; nCntModel < m_nNumParts; nCntModel++)
		{// モデルを生成した数だけ繰り返し
			m_apModel[nCntModel]->SetRot(m_pMotionManager->GetMotion()[0]->GetKeyframe()[0][nCntModel]->GetDestRot());
		}
	}
}

//=============================================================================
//    モデルの透明度を設定する
//=============================================================================
void CCharacter::SetModelAlpha(float fAlpha)
{
	if (m_apModel != NULL)
	{// モデルが作成されている
		for (int nCntModel = 0; nCntModel < m_nNumParts; nCntModel++)
		{// モデルを生成した数だけ繰り返し
			m_apModel[nCntModel]->SetAlpha(fAlpha);
		}
	}
}

//=============================================================================
//    計算された移動量を座標情報に加える処理
//=============================================================================
void CCharacter::Movement(void)
{
	// 現在の座標に移動量を加える
	m_Pos += m_Move;

	// 重力を加える
	m_Move.y += m_fGravity;

	// 移動量に慣性を加える
	m_Move.x += (0.0f - m_Move.x) * m_fInertia;
	m_Move.z += (0.0f - m_Move.z) * m_fInertia;

	// 角度の修正
	m_DiffRot.y = m_DestRot.y - m_Rot.y;   // 現在の向きと目的の向きの差分を計算

	if (m_DiffRot.y > D3DX_PI)
	{// 差分がD3DX_PIを超えた
		m_DiffRot.y -= D3DX_PI * 2.0f;
	}
	if (m_DiffRot.y < -D3DX_PI)
	{// 差分が-D3DX_PIを超えた
		m_DiffRot.y += D3DX_PI * 2.0f;
	}

	// 現在の向きに目的の向きとの差分を倍率で補正する
	m_Rot.y += m_DiffRot.y * m_fRivisionRot;

	if (m_Rot.y > D3DX_PI)
	{// 現在の向きがD3DX_PIを超えた
		m_Rot.y -= D3DX_PI * 2.0f;
	}
	if (m_Rot.y < -D3DX_PI)
	{// 現在の向きが-D3DX_PIを超えた
		m_Rot.y += D3DX_PI * 2.0f;
	}
}

//=============================================================================
//    当たり判定処理
//=============================================================================
void CCharacter::Collision(void)
{
	// デバッグ用
	if (m_Pos.y <= 0.0f)
	{
		m_Pos.y = 0.0f;
	}

	// オブジェクトとの判定開始
	CScene *pScene = NULL;               // シーンクラスへのポインタ
	CScene *pSceneNext = NULL;           // 次のシーンクラスへのポインタ
	CObject *pObject = NULL;             // 配置物クラスへのポインタ
	for (int nCntPriority = FIELD_PRIORITY; nCntPriority < MAP_PRIORITY + 1; nCntPriority++)
	{// 描画優先順位の数だけ繰り返し
		pScene = CScene::GetTop(nCntPriority);
		while (pScene != NULL)
		{// メモリが空になるまで繰り返し
			pSceneNext = pScene->GetNext();
			if (pScene->GetObjType() == OBJTYPE_OBJECT)
			{// 配置物に当たった
				pObject = (CObject*)pScene;
				if (pObject->Collision(&m_Pos, &m_PosOld, &m_Move, D3DXVECTOR3(m_fColRange,m_fColHeight,m_fColRange), &m_bLand, this) == true)
				{

				}
			}
			pScene = pSceneNext;
		}
	}

	if (m_Pos.x >= 2000.0f)
	{
		m_Pos.x = 2000.0f;
	}
	else if (m_Pos.x <= -2000.0f)
	{
		m_Pos.x = -2000.0f;
	}
	if (m_Pos.z >= 2000.0f)
	{
		m_Pos.z = 2000.0f;
	}
	else if (m_Pos.z <= -2000.0f)
	{
		m_Pos.z = -2000.0f;
	}
}

//=============================================================================
//    使用しているパーツ数を設定する
//=============================================================================
void CCharacter::SetNumParts(const int nNumParts)
{
	m_nNumParts = nNumParts;
}

//=============================================================================
//    モデルへのポインタを設定する
//=============================================================================
void CCharacter::SetModel(CModel **pModel)
{
	m_apModel = pModel;
}

//=============================================================================
//    モデルへのポインタを設定する
//=============================================================================
void CCharacter::SetModel(CModel *pModel, const int nIdx)
{
	m_apModel[nIdx] = pModel;
}

//=============================================================================
//    モーションへのポインタを設定する
//=============================================================================
void CCharacter::SetMotionManager(CMotionManager *pMotionManager)
{
	m_pMotionManager = pMotionManager;
}

//=============================================================================
//    テクスチャ管轄クラスへのポインタを設定する
//=============================================================================
void CCharacter::SetTextureManager(CTextureManager *pTextureManager)
{
	m_pTextureManager = pTextureManager;
}

//=============================================================================
//    ワールドマトリックスを設定する
//=============================================================================
void CCharacter::SetMtxWorld(const D3DXMATRIX mtxWorld)
{
	m_MtxWorld = mtxWorld;
}

//=============================================================================
//    現在の座標を設定する
//=============================================================================
void CCharacter::SetPos(const D3DXVECTOR3 pos)
{
	m_Pos = pos;
}

//=============================================================================
//    前回の座標を設定する
//=============================================================================
void CCharacter::SetPosOld(const D3DXVECTOR3 posOld)
{
	m_PosOld = posOld;
}

//=============================================================================
//    移動量を設定する
//=============================================================================
void CCharacter::SetMove(const D3DXVECTOR3 Move)
{
	m_Move = Move;
}

//=============================================================================
//    現在の向きを設定する
//=============================================================================
void CCharacter::SetRot(const D3DXVECTOR3 rot)
{
	m_Rot = rot;
}

//=============================================================================
//    目的の向きを設定する
//=============================================================================
void CCharacter::SetDestRot(const D3DXVECTOR3 Destrot)
{
	m_DestRot = Destrot;
}

//=============================================================================
//    目的の向きと現在の向きとの差分を設定する
//=============================================================================
void CCharacter::SetDiffRot(const D3DXVECTOR3 Diffrot)
{
	m_DiffRot = Diffrot;
}

//=============================================================================
//    重力を設定する
//=============================================================================
void CCharacter::SetGravity(const float fGravity)
{
	m_fGravity = fGravity;
}

//=============================================================================
//    当たり判定を取る高さを設定する
//=============================================================================
void CCharacter::SetColHeight(const float fColHeight)
{
	m_fColHeight = fColHeight;
}

//=============================================================================
//    当たり判定を取る範囲を設定する
//=============================================================================
void CCharacter::SetColRange(const float fColRange)
{
	m_fColRange = fColRange;
}

//=============================================================================
//    ジャンプ量を設定する
//=============================================================================
void CCharacter::SetJumpPower(const float fJumpPower)
{
	m_fJumpPower = fJumpPower;
}

//=============================================================================
//    向きを補正する倍率を設定する
//=============================================================================
void CCharacter::SetRivisionRot(const float fRivisionRot)
{
	m_fRivisionRot = fRivisionRot;
}

//=============================================================================
//    移動スピードを設定する
//=============================================================================
void CCharacter::SetAccel(const float fAccel)
{
	m_fAccel = fAccel;
}

//=============================================================================
//    慣性を設定する
//=============================================================================
void CCharacter::SetInertia(const float fInertia)
{
	m_fInertia = fInertia;
}

//=============================================================================
//    前回乗っていたかどうかを設定する
//=============================================================================
void CCharacter::SetLand(const bool bLand)
{
	m_bLand = bLand;
}

//=============================================================================
//    乗っているオブジェクトへのポインタを設定する
//=============================================================================
void CCharacter::SetLandScene(CScene *pLandScene)
{
	m_pLandScene = pLandScene;
}

//=============================================================================
//    前回乗っていたオブジェクトへのポインタを設定する
//=============================================================================
void CCharacter::SetLandSceneOld(CScene *pLandSceneOld)
{
	m_pLandSceneOld = pLandSceneOld;
}

//=============================================================================
//    乗っているオブジェクトとのオフセット距離を設定する
//=============================================================================
void CCharacter::SetLandOffsetPos(const D3DXVECTOR3 LandOffsetPos)
{
	m_LandOffsetPos = LandOffsetPos;
}

//=============================================================================
//    オフセット距離に加える値を設定する
//=============================================================================
void CCharacter::SetLandOffsetAdd(const D3DXVECTOR3 LandOffsetAdd)
{
	m_LandOffsetAdd = LandOffsetAdd;
}

//=============================================================================
//    乗っているオブジェクトとのオフセット向きを設定する
//=============================================================================
void CCharacter::SetLandOffsetRot(const D3DXVECTOR3 LandOffsetRot)
{
	m_LandOffsetRot = LandOffsetRot;
}

//=============================================================================
//    乗ってからの向きを設定する
//=============================================================================
void CCharacter::SetLandOffsetRotStart(const D3DXVECTOR3 LandOffsetRotStart)
{
	m_LandOffsetRotStart = LandOffsetRotStart;
}

//=============================================================================
//    影クラスへのポインタを設定する
//=============================================================================
void CCharacter::SetShadow(CShadow *pShadow)
{
	m_pShadow = pShadow;
}

//=============================================================================
//    使用しているパーツ数を取得する
//=============================================================================
int CCharacter::GetNumParts(void)
{
	return m_nNumParts;
}

//=============================================================================
//    モデルへのポインタを取得する
//=============================================================================
CModel **CCharacter::GetModel(void)
{
	return m_apModel;
}

//=============================================================================
//    モデルへのポインタを取得する
//=============================================================================
CModel *CCharacter::GetModel(const int nIdx)
{
	return m_apModel[nIdx];
}

//=============================================================================
//    モーションクラスへのポインタを取得する
//=============================================================================
CMotionManager *CCharacter::GetMotionManager(void)
{
	return m_pMotionManager;
}

//=============================================================================
//    テクスチャ管轄クラスへのポインタを取得する
//=============================================================================
CTextureManager *CCharacter::GetTextureManager(void)
{
	return m_pTextureManager;
}

//=============================================================================
//    ワールドマトリックスを取得する
//=============================================================================
D3DXMATRIX CCharacter::GetMtxWorld(void)
{
	return m_MtxWorld;
}

//=============================================================================
//    現在の座標を取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetPos(void)
{
	return m_Pos;
}

//=============================================================================
//    前回の座標を取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetPosOld(void)
{
	return m_PosOld;
}

//=============================================================================
//    移動量を取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetMove(void)
{
	return m_Move;
}

//=============================================================================
//    現在の向きを取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetRot(void)
{
	return m_Rot;
}

//=============================================================================
//    目的の向きを取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetDestRot(void)
{
	return m_DestRot;
}

//=============================================================================
//    目的の向きと現在の向きとの差分を取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetDiffRot(void)
{
	return m_DiffRot;
}

//=============================================================================
//    重力を取得する
//=============================================================================
float CCharacter::GetGravity(void)
{
	return m_fGravity;
}

//=============================================================================
//    当たり判定を取る高さを取得する
//=============================================================================
float CCharacter::GetColHeight(void)
{
	return m_fColHeight;
}

//=============================================================================
//    当たり判定を取る範囲を取得する
//=============================================================================
float CCharacter::GetColRange(void)
{
	return m_fColRange;
}

//=============================================================================
//    ジャンプ量を取得する
//=============================================================================
float CCharacter::GetJumpPower(void)
{
	return m_fJumpPower;
}

//=============================================================================
//    向きを補正する倍率を取得する
//=============================================================================
float CCharacter::GetRivisionRot(void)
{
	return m_fRivisionRot;
}

//=============================================================================
//    移動スピードを取得する
//=============================================================================
float CCharacter::GetAccel(void)
{
	return m_fAccel;
}

//=============================================================================
//    慣性量を取得する
//=============================================================================
float CCharacter::GetInertia(void)
{
	return m_fInertia;
}

//=============================================================================
//    前回乗っていたかどうかを取得する
//=============================================================================
bool CCharacter::GetLand(void)
{
	return m_bLand;
}

//=============================================================================
//    乗っているオブジェクトへのポインタを取得する
//=============================================================================
CScene *CCharacter::GetLandScene(void)
{
	return m_pLandScene;
}

//=============================================================================
//    前回乗っていたオブジェクトへのポインタを取得する
//=============================================================================
CScene *CCharacter::GetLandSceneOld(void)
{
	return m_pLandSceneOld;
}

//=============================================================================
//    乗っているオブジェクトとのオフセット距離を取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetLandOffsetPos(void)
{
	return m_LandOffsetPos;
}

//=============================================================================
//    オフセットに加える値を取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetLandOffsetAdd(void)
{
	return m_LandOffsetAdd;
}

//=============================================================================
//    乗っているオブジェクトとのオフセット向きを取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetLandOffsetRot(void)
{
	return m_LandOffsetRot;
}

//=============================================================================
//    乗ってからの向きを取得する
//=============================================================================
D3DXVECTOR3 CCharacter::GetLandOffsetRotStart(void)
{
	return m_LandOffsetRotStart;
}

//=============================================================================
//    影クラスへのポインタを取得する
//=============================================================================
CShadow *CCharacter::GetShadow(void)
{
	return m_pShadow;
}
