//=============================================================================
//
// 結果画面処理 [result.h]
// Author : Niwa Hodaka
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef enum
{
	RESULT_PLAYER1_WIN = 0,		// プレイヤー１勝利
	RESULT_PLAYER2_WIN,			// プレイヤー２勝利
	RESULTMAX
}RESULT;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);
void SetResult(RESULT result);
RESULT GetResult(void);

#endif
