//=============================================================================
//
// 空の処理 [sky.h]
// Author : Hodaka Niwa
//
//=============================================================================
#ifndef _SKY_H_
#define _SKY_H_

#include "main.h"

//*****************************************************************************
// 半球の構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;        // 座標
	D3DXVECTOR3 rot;        // 向き
	D3DXMATRIX  mtxWorld;   // ワールドマトリックス
	float       Length;     // 縦の長さ
	float       Side;       // 横の長さ
	int         XBlock;     // 横の分割数
	int         YBlock;     // 縦の分割数
	int         nNumVertex; // 頂点数
	int         nNumIndex;  // インデックス数
	int         nNumPolygon;// ポリゴン数
}Sky;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSky(void);
void UninitSky(void);
void UpdateSky(void);
void DrawSky(void);

#endif