//=============================================================================
//
// タイトルロゴ処理 [titlelogo.h]
// Author  Jukiya Hayakawa
//
//=============================================================================
#ifndef _TITLELOGO_H_
#define _TITLELOGO_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TITlELOGO			(2)								// タイトルロゴの総数

//*****************************************************************************
// タイトルロゴの構造体の定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3  pos;                       // 位置
	D3DXCOLOR	 col;						// 色
	float		 fWidth;					// 幅
	float		 fHeight;					// 高さ
}TitleLogo;
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitleLogo(void);
void UninitTitleLogo(void);
void UpdateTitleLogo(void);
void DrawTitleLogo(void);
#endif